content-org/website.org
#+HUGO_BASE_DIR: ~/Documents/almoszediu-website
#+HUGO_FRONT_MATTER_KEY_REPLACE: author>nil

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
** TODO Yet another praise for Doom :emacs:
:PROPERTIES:
:EXPORT_FILE_NAME: yet-another-praise-for-doom
:EXPORT_DATE: 2020-05-14
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :featuredImage "/images/doom-logo.png"
:END:
*** The Vim times
I know, everybody and their mother-in-law have already talked about this, but I
think this thing cannot be understated: "Emacs is a good operating system, it
only lacks a decent text editor.". I've tried to use Vim as my main text editor,
I really did. I took a deep breath and tried to find the perfect Python packages
for me to install, trying to emulate the nice features of the previous Electron
based VS Code, from which I've departed with an aching hear
