content/posts/yet-another-praise-for-doom.md
+++
title = "Yet another praise for Doom"
date = 2020-05-14
lastmod = 2020-05-27T20:17:49+03:00
tags = ["emacs"]
categories = ["emacs"]
draft = true
weight = 2001
featuredImage = "/images/doom-logo.png"
+++

## The Vim times {#the-vim-times}

I know, everybody and their mother-in-law have already talked about this, but I
think this thing cannot be understated: "Emacs is a good operating system, it
only lacks a decent text editor.". I've tried to use Vim as my main text editor,
I really did. I took a deep breath and tried to find the perfect Python packages
for me to install, trying to emulate the nice features of the previous Electron
based VS Code, from which I've departed with an aching hear
